"""
这是我研究表格的时候用的，从这里找出的规律！
"""
import math
# gka????bd?i?f?c?bh?j??f??e?g?j?e?chd??a????k???i??j???he
# gkam?tlbdqiyfucxbhsjoprnweygtjmevchdxsanqolkrvwiypj?quhe
a = "阶剂收度索图将航否目益" # 除以56余 2和38 0反例
b = "质炸烧继提开亏弹获显成是材赠文需齿纯率荐" # 除以56余 16和7 2反例
c = "要爆取站等天后集分这持险金" # 除以56余 33和14 1反例
d = "捷默进限力千呀坐谈别全" # 除以56余 35和8 1反例
e = "矿量伯选级产端谷求控品切式字备废耗料让流荷安留黯得近枪休" # 除以56余 31 25 55 2反例
f = "预礼同两汞" # 除以56余 12 ? 0反例
g = "器离养打盈什罐骨陈元效即昨素快" # 除以56余 0 27 0反例
h = "键容莉恢醚酒计需塞锚点满件为固送会影暂我防桩了武跑" # 除以56余 17 34 54 3反例
i = "阿药请掷访喷号今刷示形启息建每小排基" # 除以56余 10 47 1反例
j = "仓库石距人客性巫空兽雕旋弃重输卫" # 19 29 50
k = "物右有励心阻网当布民项下" #1 43
l = "场回上松市枢拦于定时干" # 6 42
m = "友确四置详议然调至据风" #3 30
n = "采使线升具生万术可功样" # 23 39
o = "认次隔停" # 20 41
p = "脉中助厉纽态情初" #21 49
q = "择发数，舱培拜消卡悬信" # 9 40 52
r = "作理的资头奖靶修" #22 44
s = "投语换遍以待内多响丽"# 18 37
t = "复交衍好拥组破完" #5 28
u = "工试前名短者严载挥续报" #13 53
v = "快一存用梅电木终地日不表" #32 45
w = "源制放在厨版运设化" # 24 46
x = "原货本转景果受" # 15 36
y = "智探览驻造新区" #26 48
z = "正行总钻供程压二"

zf = "你好，管理员"
for _ in a:
    print(_,hex(ord(_))[2:],"→",str(ord(_)%28))
print()
